// Задача 19
// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

// Console.WriteLine("Введите пятизначное число.");
// int userNumber = int.Parse(Console.ReadLine());
// int number = userNumber;
// int reverse = 0;

// if(userNumber > 9999 && userNumber < 100000)
// {
// for(int i = 0; i < 5; i++)
// {
//     int rev = number%10;
//     reverse = reverse*10 + rev;
//     number = number/10;
// }
// if(userNumber == reverse)
// {
//     Console.WriteLine($"Число {userNumber} - является палиндромом.");
// }
// else
// {
//     Console.WriteLine($"Число {userNumber} - не является палиндром.");
// }
// }
// else
// {
//     Console.WriteLine("Введено некорректное число.");
// }