//Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

// Console.WriteLine("Введите число А: ");
// int firstNumb = int.Parse(Console.ReadLine()!);
// Console.WriteLine("Введите число B: ");
// int secondNumb = int.Parse(Console.ReadLine()!);

// Console.WriteLine(GetMult(firstNumb, secondNumb));


// double GetMult(int one, int two)
// {
//     double multi = Math.Pow(one, two);
//     return multi;
// }